In [1]:
import pandas as pd
import numpy as np

In [3]:
company=["A","B","C"]

data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
}
)

In [4]:
data

  company  salary  age
0       B      34   37
1       A      27   20
2       C      35   38
3       A      20   21
4       C       5   39
5       A      47   17
6       B       7   16
7       C      41   25
8       A      36   29
9       A      10   23

In [6]:
group=data.groupby("company")

In [7]:
list(group)

[('A',
    company  salary  age
  1       A      27   20
  3       A      20   21
  5       A      47   17
  8       A      36   29
  9       A      10   23),
 ('B',
    company  salary  age
  0       B      34   37
  6       B       7   16),
 ('C',
    company  salary  age
  2       C      35   38
  4       C       5   39
  7       C      41   25)]